[
  {
    "id": 1,
    "text": "I need precise instructions to know what is expected of me                                         ",
    "dim": "C1"
  },
  {
    "id": 2,
    "text": "An individual should prioritize group's interest to her/his own                                                                  ",
    "dim": "C3"
  },
  {
    "id": 3,
    "text": "I think that handling money carefully is of utmost importance                                                               ",
    "dim": "C4"
  },
  {
    "id": 4,
    "text": "My primary goal in decision making is to achieve the best results, regardless of whether I will outshine others by that",
    "dim": "C2"
  },
  {
    "id": 5,
    "text": "It is not desirable for managers to often consult lower-ranked employees                                   ",
    "dim": "C2"
  },
  {
    "id": 6,
    "text": "Following rules and procedures is crucial for good work                                                            ",
    "dim": "C1"
  },
  {
    "id": 7,
    "text": "Even in difficult times, people should remain loyal to their group                                           ",
    "dim": "C3"
  },
  {
    "id": 8,
    "text": "For me, it is greatly important to persist even when I am facing resistance                                                          ",
    "dim": "C4"
  },
  {
    "id": 9,
    "text": "In the decision making process, people's feelings are not an important factor                                                 ",
    "dim": "C2"
  },
  {
    "id": 10,
    "text": "Rules and regulations help me greatly to know what is expected of me                                                          ",
    "dim": "C1"
  },
  {
    "id": 11,
    "text": "Group's progress is more important than individuals' standing out                                                           ",
    "dim": "C3"
  },
  {
    "id": 12,
    "text": "The effect of decisions on people's feelings and relationships does not matter to me.                                                             ",
    "dim": "C2"
  },
  {
    "id": 13,
    "text": "Standardized procedures make work easier                                                               ",
    "dim": "C1"
  },
  {
    "id": 14,
    "text": "Team success is much more preferable than individual's success                                                                             ",
    "dim": "C3"
  },
  {
    "id": 15,
    "text": "Long-term planning is of utmost importance to me                                                                        ",
    "dim": "C4"
  },
  {
    "id": 16,
    "text": "I'm extra satisfied when my decisions yield better results than the results my colleagues achieved.                               ",
    "dim": "C2"
  },
  {
    "id": 17,
    "text": "Important tasks and commitments should not be delegated to lower-ranked employees                                              ",
    "dim": "C2"
  },
  {
    "id": 18,
    "text": "Clear procedures are crucial in successfull accomplishment of the task                                                         ",
    "dim": "C1"
  },
  {
    "id": 19,
    "text": "Before one commits to one's own goals, she/he should consider how they would affect the group         ",
    "dim": "C3"
  },
  {
    "id": 20,
    "text": "I am ready to give up fun today for the sake of future success                                                       ",
    "dim": "C4"
  },
  {
    "id": 21,
    "text": "Loyalty to the group should be encouraged even when it collides with personal goals                                       ",
    "dim": "C3"
  },
  {
    "id": 22,
    "text": "Hard work for future success is greatly important to me.                                                           ",
    "dim": "C4"
  }
]
